public/ephemeris/2025-03-19.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="../autobiography/chronological.html">Chronological</a> &gt; <a href="ephemeris.html">Ephemeris</a> &gt; <a href="entries.html">Entries</a> &gt;
</p>

<div id="outline-container-orgbff5b92" class="outline-2">
<h2 id="orgbff5b92">2025-03-19</h2>
<div class="outline-text-2" id="text-orgbff5b92">
<p>
I was reading the post "On the Stoic harmony with nature" of Prod
where he talks of phylosophy, I wanted to save It here for the record
because It was such an interesting read:
</p>

<p>
In Greece we have a saying that comes to us from antiquity: “nothing
bad not intermixed with good” (ουδέν κακόν αμιγές καλού). A liberal
translation is “there is no pure evil in this world as everything we
find that is bad always has some good mixed into it.” The opposite is
also true, namely, that all good things have some bad inherent to them.
</p>

<p>
[&#x2026;]
</p>

<p>
In nature things happen when they are meant to. Consider how trees
blossom when their spring arrives, bears hibernate during winter, rain
drops when there are clouds, and so on. No phenomenon can be decoupled
from its fundamentals and, by extension, no event can be independent
of the totality of phenomena. The same is true for the human condition,
though we may lack that kind of patience in our deeds to see how some
eventuality is the result of dynamics that build up over time.
</p>

<p>
[&#x2026;]
</p>

<p>
The Greek word for “nature” is “physis” (φύσις) which refers to things
that grow. They develop organically, as noted above, and have a life
of their own that is couched in terms of the cosmic continuum of life:
they are all coexistent and interdependent. To live in accordance with
nature, then, is to go with the flow of the prevailing conditions,
else to be adaptable. When trees cannot grow directly upward because
some obstacle is in their way, they grow sideways, circumventing the
problem.
</p>

<p>
Compare this to the attitude of forcing things to happen, of declaring
our wants, and trying to implement them regardless of the prevailing
conditions. If the tree insists on only going straight up, then it
will perish. Same principle for humans. What would my life be like
had I insisted on becoming a footballer and did not show the requisite
adaptability to try new things and to ultimately find value in them?
I would probably be miserable the whole time, as I would be fighting
against forces I could not overcome, never to realise my goal, and
never to have the necessary openness to take in what the world was
showing me.
</p>

<p>
End note: thank you Prod for your wisdom.
</p>

<hr />

<p>
Travel: <a href="ephemeris.html">Ephemeris</a>, <a href="../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
